{
    "date": "2025-03-25",
    "time": "22:23:12",
    "content": "Bored af rn so might swell type some shit\r\nCame back from my doomer flicker something walk not that much today just 5k steps, i had no clue but there's like a yoga class happening in the gym??? lot's of grannies soooo. took a shower and now just i just kinda exist. the feeling yesterday was so fucking shit like on god... but it was justified, i had done some horrible shit to folks i love, it was a mix of feeling like a failure cuz no man should ever make a girl sad, mixed with feeling like the end is near, the idea of exposing the bad and the ugly infront of everyone is very... suffocating... i wish i only shown the good but noone is like this, everyone has the bad and the ugly. i hope the therapist can explain it to me more, but i feel right now that it wont,that i should just abandon all hope, fuck... oh well... i fucked up and i need to get better. and that was topped with me fears... it got combined into this shit feeling but i managed to explain it to myself so i feel better... my situation hasn't changed, but i feel better today.\r\nalso today the high presser hose came and ngl it's fun having a compressor i dusted my pc COVERRING EVERYTHING IN THE BASMENT WITH DUST LMFAOO and it doesnt help that the breaker pops when using plugs so i have to use this janky light bulb e27 to normal socket it feels so wrong drawing 1100 watts trough that but whatever if it's starts smoking maybe i will die lmao, it's also got super sketchy cuz the light bulb broke so i had to somehow get the small tungsten rod connected INSIDE THE LIGHTBULB but i managed to shake it a bit and get it so the tungsten makes contact nice (also it's so fun seeing how the light go dim when i plug the compresso into the normal wall outlet),\r\ntomorrow is the dentist visit at 5 i have two teeth to fix so maybe i'll get one done i hope and other then that idk not much happened\r\n\r\ntldr i made a simple proof of concept for the discord roleplaying bot, doom walked, dusted the pc and that's it? i think"
}