{
    "id": "post_167eaf7c10d620",
    "date": "2025-03-31",
    "time": "22:14:57",
    "content": "Well then march is almost over… this may be the worst month so far, i hate it i absolutely hate march right now, let’s start. \r\nStarting off strong, nothing new applied to a few jobs, no responses, got one phone call saying we’ll be in touch and you guessed it no response for a month like most of them but…\r\nonly for me to do a horrible job, I really misunderstand and hurt people I care for. I had it coming. I did something like this in the past but I got over it quickly, but now it’s different. I felt jealousy for something that I never should have been… i really really fucked up, so i tried to explaining it… only to make it worst, god so much worst… it’s hard to even think about cuz i wrote it, it was me, but… it’s not something i want to be so… i have tried to fix it after and i think i succeed or did i… at this point i have no clue, now it’s been almost a month and i have no idea what to do, i tried getting professionals help but as per usual with me, it got delayed but a factor i have no control over, the doc got sick, i wish i could just swallow pills and don’t feel anything… exposing myself like that, fucking up, and thinking of a way to undo what i fucked up is taxing on me… I am just doomed to suffer. I hope at least that they are happy, but I will never know. It just feels like… people play the role that they want others to see them as, i feel like i'm not doing that, and never done it, i feel like i'm showing what i really am. the good, the bad and the ugly… I was able to control my ugly side… oh well… I am really lost, I have a naive feeling that I can fix it, even though I feel worst, I feel stressed and sad… it is what it is…\r\nAlso in march my poor dog got cancer, breast cancer like how unluck and luck was that that we manage to detect it early and got it surgically removed in time, poor little dog had no idea and now it looks so sad with it’s scar it massive afterall \r\nAnd my brother finally passed the driving exam, 5 tries it took but he did it, now i have no access to the car cuz he always takes it, it really starts to get on my nerves, but as long as he fuels it it’s ok\r\nStarted doing those weird walks at night. I think they help me cope with what I feel. It feels like I can do stuff. I still have an opportunity to walk and writing things down helps me a lot.\r\nOther than that is our usual play, scott is busy with his work so i see him less we play less but like i understand we all adults so, anvil is kinda crazy cuz i never expected to have this many people to play it and done some programming it was fun new subpage on the website and even managed to get an roleplaying ai to work with discord bot. Started terraria playthrough as a way to cope but it aint worked soo abandoned it. Also i heart psp's voice i never expected him to be with deme especially after what nikita has done to her but i was super happy to hear him my goat he was the funniest but he fucked up with deme bad like wtf bad and to here him on her stream was nuts so i assume he's getting the help he needs\r\nI think that’s all, in short my mentals tanked, dog got sick, played enough games with tards and have a weird habit now... In shorter short im trying to get better and happy, maybe this little flame of hope will bloom or something deep like this lmfaoo\r\n\r\n"
}
